Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8585.PIC
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="RXF7SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="RXF7SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xD65">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF7EID16" edc:desc="" edc:mask="0x1" edc:name="RXF7EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID17" edc:desc="" edc:mask="0x1" edc:name="RXF7EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF7EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF7EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID0" edc:desc="" edc:mask="0x1" edc:name="RXF7SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID1" edc:desc="" edc:mask="0x1" edc:name="RXF7SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7SID2" edc:desc="" edc:mask="0x1" edc:name="RXF7SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF7EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF7EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD66">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF7EID8" edc:desc="" edc:mask="0x1" edc:name="RXF7EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID9" edc:desc="" edc:mask="0x1" edc:name="RXF7EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID10" edc:desc="" edc:mask="0x1" edc:name="RXF7EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID11" edc:desc="" edc:mask="0x1" edc:name="RXF7EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID12" edc:desc="" edc:mask="0x1" edc:name="RXF7EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID13" edc:desc="" edc:mask="0x1" edc:name="RXF7EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID14" edc:desc="" edc:mask="0x1" edc:name="RXF7EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID15" edc:desc="" edc:mask="0x1" edc:name="RXF7EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF7EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF7EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD67">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF7EID0" edc:desc="" edc:mask="0x1" edc:name="RXF7EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID1" edc:desc="" edc:mask="0x1" edc:name="RXF7EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID2" edc:desc="" edc:mask="0x1" edc:name="RXF7EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID3" edc:desc="" edc:mask="0x1" edc:name="RXF7EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID4" edc:desc="" edc:mask="0x1" edc:name="RXF7EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID5" edc:desc="" edc:mask="0x1" edc:name="RXF7EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID6" edc:desc="" edc:mask="0x1" edc:name="RXF7EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF7EID7" edc:desc="" edc:mask="0x1" edc:name="RXF7EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF8SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF8SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD68">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF8SID3" edc:desc="" edc:mask="0x1" edc:name="RXF8SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID4" edc:desc="" edc:mask="0x1" edc:name="RXF8SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID5" edc:desc="" edc:mask="0x1" edc:name="RXF8SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID6" edc:desc="" edc:mask="0x1" edc:name="RXF8SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID7" edc:desc="" edc:mask="0x1" edc:name="RXF8SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID8" edc:desc="" edc:mask="0x1" edc:name="RXF8SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID9" edc:desc="" edc:mask="0x1" edc:name="RXF8SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID10" edc:desc="" edc:mask="0x1" edc:name="RXF8SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="RXF8SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="RXF8SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xD69">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF8EID16" edc:desc="" edc:mask="0x1" edc:name="RXF8EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID17" edc:desc="" edc:mask="0x1" edc:name="RXF8EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF8EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF8EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID0" edc:desc="" edc:mask="0x1" edc:name="RXF8SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID1" edc:desc="" edc:mask="0x1" edc:name="RXF8SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8SID2" edc:desc="" edc:mask="0x1" edc:name="RXF8SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF8EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF8EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD6A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF8EID8" edc:desc="" edc:mask="0x1" edc:name="RXF8EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID9" edc:desc="" edc:mask="0x1" edc:name="RXF8EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID10" edc:desc="" edc:mask="0x1" edc:name="RXF8EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID11" edc:desc="" edc:mask="0x1" edc:name="RXF8EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID12" edc:desc="" edc:mask="0x1" edc:name="RXF8EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID13" edc:desc="" edc:mask="0x1" edc:name="RXF8EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID14" edc:desc="" edc:mask="0x1" edc:name="RXF8EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID15" edc:desc="" edc:mask="0x1" edc:name="RXF8EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF8EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF8EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF8EID0" edc:desc="" edc:mask="0x1" edc:name="RXF8EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID1" edc:desc="" edc:mask="0x1" edc:name="RXF8EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID2" edc:desc="" edc:mask="0x1" edc:name="RXF8EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID3" edc:desc="" edc:mask="0x1" edc:name="RXF8EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID4" edc:desc="" edc:mask="0x1" edc:name="RXF8EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID5" edc:desc="" edc:mask="0x1" edc:name="RXF8EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID6" edc:desc="" edc:mask="0x1" edc:name="RXF8EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF8EID7" edc:desc="" edc:mask="0x1" edc:name="RXF8EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xD6C"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF9SIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF9SIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD70">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="SID3" edc:desc="" edc:mask="0x1" edc:name="SID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID4" edc:desc="" edc:mask="0x1" edc:name="SID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID5" edc:desc="" edc:mask="0x1" edc:name="SID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID6" edc:desc="" edc:mask="0x1" edc:name="SID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID7" edc:desc="" edc:mask="0x1" edc:name="SID7" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID8" edc:desc="" edc:mask="0x1" edc:name="SID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID9" edc:desc="" edc:mask="0x1" edc:name="SID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID10" edc:desc="" edc:mask="0x1" edc:name="SID10" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF9SID3" edc:desc="" edc:mask="0x1" edc:name="RXF9SID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID4" edc:desc="" edc:mask="0x1" edc:name="RXF9SID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID5" edc:desc="" edc:mask="0x1" edc:name="RXF9SID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID6" edc:desc="" edc:mask="0x1" edc:name="RXF9SID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID7" edc:desc="" edc:mask="0x1" edc:name="RXF9SID7" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID8" edc:desc="" edc:mask="0x1" edc:name="RXF9SID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID9" edc:desc="" edc:mask="0x1" edc:name="RXF9SID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID10" edc:desc="" edc:mask="0x1" edc:name="RXF9SID10" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="RXF9SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="RXF9SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xD71">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF9EID16" edc:desc="" edc:mask="0x1" edc:name="RXF9EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9EID17" edc:desc="" edc:mask="0x1" edc:name="RXF9EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF9EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF9EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID0" edc:desc="" edc:mask="0x1" edc:name="RXF9SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID1" edc:desc="" edc:mask="0x1" edc:name="RXF9SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF9SID2" edc:desc="" edc:mask="0x1" edc:name="RXF9SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
