Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8585.PIC
        <edc:SFRDef edc:access="nnnnn-nn" edc:cname="RXF12SIDL" edc:desc="" edc:impl="0xfb" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuu-uu" edc:name="RXF12SIDL" edc:nzwidth="0x8" edc:por="xxxxx-xx" edc:_addr="0xD81">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID16" edc:desc="" edc:mask="0x1" edc:name="EID16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID17" edc:desc="" edc:mask="0x1" edc:name="EID17" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="EXIDEN" edc:desc="" edc:mask="0x1" edc:name="EXIDEN" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="SID0" edc:desc="" edc:mask="0x1" edc:name="SID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID1" edc:desc="" edc:mask="0x1" edc:name="SID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SID2" edc:desc="" edc:mask="0x1" edc:name="SID2" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="EXIDE" edc:desc="" edc:mask="0x1" edc:name="EXIDE" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF12EID16" edc:desc="" edc:mask="0x1" edc:name="RXF12EID16" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID17" edc:desc="" edc:mask="0x1" edc:name="RXF12EID17" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF12EXIDEN" edc:desc="" edc:mask="0x1" edc:name="RXF12EXIDEN" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID0" edc:desc="" edc:mask="0x1" edc:name="RXF12SID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID1" edc:desc="" edc:mask="0x1" edc:name="RXF12SID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12SID2" edc:desc="" edc:mask="0x1" edc:name="RXF12SID2" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF12EIDH" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF12EIDH" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD82">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID8" edc:desc="" edc:mask="0x1" edc:name="EID8" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID9" edc:desc="" edc:mask="0x1" edc:name="EID9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID10" edc:desc="" edc:mask="0x1" edc:name="EID10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID11" edc:desc="" edc:mask="0x1" edc:name="EID11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID12" edc:desc="" edc:mask="0x1" edc:name="EID12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID13" edc:desc="" edc:mask="0x1" edc:name="EID13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID14" edc:desc="" edc:mask="0x1" edc:name="EID14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID15" edc:desc="" edc:mask="0x1" edc:name="EID15" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF12EID8" edc:desc="" edc:mask="0x1" edc:name="RXF12EID8" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID9" edc:desc="" edc:mask="0x1" edc:name="RXF12EID9" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID10" edc:desc="" edc:mask="0x1" edc:name="RXF12EID10" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID11" edc:desc="" edc:mask="0x1" edc:name="RXF12EID11" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID12" edc:desc="" edc:mask="0x1" edc:name="RXF12EID12" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID13" edc:desc="" edc:mask="0x1" edc:name="RXF12EID13" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID14" edc:desc="" edc:mask="0x1" edc:name="RXF12EID14" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID15" edc:desc="" edc:mask="0x1" edc:name="RXF12EID15" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXF12EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="RXF12EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xD83">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="RXF12EID0" edc:desc="" edc:mask="0x1" edc:name="RXF12EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID1" edc:desc="" edc:mask="0x1" edc:name="RXF12EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID2" edc:desc="" edc:mask="0x1" edc:name="RXF12EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID3" edc:desc="" edc:mask="0x1" edc:name="RXF12EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID4" edc:desc="" edc:mask="0x1" edc:name="RXF12EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID5" edc:desc="" edc:mask="0x1" edc:name="RXF12EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID6" edc:desc="" edc:mask="0x1" edc:name="RXF12EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="RXF12EID7" edc:desc="" edc:mask="0x1" edc:name="RXF12EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
