Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8585.PIC
        <edc:AdjustPoint edc:offset="7" edc:_addr="0xDD9"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON0" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDE0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F0BP_0" edc:desc="" edc:mask="0x1" edc:name="F0BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F0BP_1" edc:desc="" edc:mask="0x1" edc:name="F0BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F0BP_2" edc:desc="" edc:mask="0x1" edc:name="F0BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F0BP_3" edc:desc="" edc:mask="0x1" edc:name="F0BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F1BP_0" edc:desc="" edc:mask="0x1" edc:name="F1BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F1BP_1" edc:desc="" edc:mask="0x1" edc:name="F1BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F1BP_2" edc:desc="" edc:mask="0x1" edc:name="F1BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F1BP_3" edc:desc="" edc:mask="0x1" edc:name="F1BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F0BP_01" edc:desc="" edc:mask="0x1" edc:name="F0BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010001" edc:name="RXFBCON1" edc:nzwidth="0x8" edc:por="00010001" edc:_addr="0xDE1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F2BP_0" edc:desc="" edc:mask="0x1" edc:name="F2BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F2BP_1" edc:desc="" edc:mask="0x1" edc:name="F2BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F2BP_2" edc:desc="" edc:mask="0x1" edc:name="F2BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F2BP_3" edc:desc="" edc:mask="0x1" edc:name="F2BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F3BP_0" edc:desc="" edc:mask="0x1" edc:name="F3BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F3BP_1" edc:desc="" edc:mask="0x1" edc:name="F3BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F3BP_2" edc:desc="" edc:mask="0x1" edc:name="F3BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F3BP_3" edc:desc="" edc:mask="0x1" edc:name="F3BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F2BP_01" edc:desc="" edc:mask="0x1" edc:name="F2BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00010001" edc:name="RXFBCON2" edc:nzwidth="0x8" edc:por="00010001" edc:_addr="0xDE2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F4BP_0" edc:desc="" edc:mask="0x1" edc:name="F4BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F4BP_1" edc:desc="" edc:mask="0x1" edc:name="F4BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F4BP_2" edc:desc="" edc:mask="0x1" edc:name="F4BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F4BP_3" edc:desc="" edc:mask="0x1" edc:name="F4BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F5BP_0" edc:desc="" edc:mask="0x1" edc:name="F5BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F5BP_1" edc:desc="" edc:mask="0x1" edc:name="F5BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F5BP_2" edc:desc="" edc:mask="0x1" edc:name="F5BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F5BP_3" edc:desc="" edc:mask="0x1" edc:name="F5BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F4BP_01" edc:desc="" edc:mask="0x1" edc:name="F4BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON3" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDE3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F6BP_0" edc:desc="" edc:mask="0x1" edc:name="F6BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F6BP_1" edc:desc="" edc:mask="0x1" edc:name="F6BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F6BP_2" edc:desc="" edc:mask="0x1" edc:name="F6BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F6BP_3" edc:desc="" edc:mask="0x1" edc:name="F6BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F7BP_0" edc:desc="" edc:mask="0x1" edc:name="F7BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F7BP_1" edc:desc="" edc:mask="0x1" edc:name="F7BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F7BP_2" edc:desc="" edc:mask="0x1" edc:name="F7BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F7BP_3" edc:desc="" edc:mask="0x1" edc:name="F7BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F6BP_01" edc:desc="" edc:mask="0x1" edc:name="F6BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON4" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDE4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F8BP_0" edc:desc="" edc:mask="0x1" edc:name="F8BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F8BP_1" edc:desc="" edc:mask="0x1" edc:name="F8BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F8BP_2" edc:desc="" edc:mask="0x1" edc:name="F8BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F8BP_3" edc:desc="" edc:mask="0x1" edc:name="F8BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F9BP_0" edc:desc="" edc:mask="0x1" edc:name="F9BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F9BP_1" edc:desc="" edc:mask="0x1" edc:name="F9BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F9BP_2" edc:desc="" edc:mask="0x1" edc:name="F9BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F9BP_3" edc:desc="" edc:mask="0x1" edc:name="F9BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F8BP_01" edc:desc="" edc:mask="0x1" edc:name="F8BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON5" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDE5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F10BP_0" edc:desc="" edc:mask="0x1" edc:name="F10BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F10BP_1" edc:desc="" edc:mask="0x1" edc:name="F10BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F10BP_2" edc:desc="" edc:mask="0x1" edc:name="F10BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F10BP_3" edc:desc="" edc:mask="0x1" edc:name="F10BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F11BP_0" edc:desc="" edc:mask="0x1" edc:name="F11BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F11BP_1" edc:desc="" edc:mask="0x1" edc:name="F11BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F11BP_2" edc:desc="" edc:mask="0x1" edc:name="F11BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F11BP_3" edc:desc="" edc:mask="0x1" edc:name="F11BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F10BP_01" edc:desc="" edc:mask="0x1" edc:name="F10BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON6" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDE6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F12BP_0" edc:desc="" edc:mask="0x1" edc:name="F12BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F12BP_1" edc:desc="" edc:mask="0x1" edc:name="F12BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F12BP_2" edc:desc="" edc:mask="0x1" edc:name="F12BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F12BP_3" edc:desc="" edc:mask="0x1" edc:name="F12BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F13BP_0" edc:desc="" edc:mask="0x1" edc:name="F13BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F13BP_1" edc:desc="" edc:mask="0x1" edc:name="F13BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F13BP_2" edc:desc="" edc:mask="0x1" edc:name="F13BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F13BP_3" edc:desc="" edc:mask="0x1" edc:name="F13BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F12BP_01" edc:desc="" edc:mask="0x1" edc:name="F12BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="RXFBCON7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="RXFBCON7" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDE7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="F14BP_0" edc:desc="" edc:mask="0x1" edc:name="F14BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F14BP_1" edc:desc="" edc:mask="0x1" edc:name="F14BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F14BP_2" edc:desc="" edc:mask="0x1" edc:name="F14BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F14BP_3" edc:desc="" edc:mask="0x1" edc:name="F14BP_3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F15BP_0" edc:desc="" edc:mask="0x1" edc:name="F15BP_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F15BP_1" edc:desc="" edc:mask="0x1" edc:name="F15BP_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F15BP_2" edc:desc="" edc:mask="0x1" edc:name="F15BP_2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="F15BP_3" edc:desc="" edc:mask="0x1" edc:name="F15BP_3" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="F14BP_01" edc:desc="" edc:mask="0x1" edc:name="F14BP_01" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="8" edc:_addr="0xDE8"/>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MSEL0" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDF0">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL0_0" edc:desc="" edc:mask="0x1" edc:name="FIL0_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL0_1" edc:desc="" edc:mask="0x1" edc:name="FIL0_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL1_0" edc:desc="" edc:mask="0x1" edc:name="FIL1_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL1_1" edc:desc="" edc:mask="0x1" edc:name="FIL1_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL2_0" edc:desc="" edc:mask="0x1" edc:name="FIL2_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL2_1" edc:desc="" edc:mask="0x1" edc:name="FIL2_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL3_0" edc:desc="" edc:mask="0x1" edc:name="FIL3_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL3_1" edc:desc="" edc:mask="0x1" edc:name="FIL3_1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MSEL1" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDF1">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL4_0" edc:desc="" edc:mask="0x1" edc:name="FIL4_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL4_1" edc:desc="" edc:mask="0x1" edc:name="FIL4_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL5_0" edc:desc="" edc:mask="0x1" edc:name="FIL5_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL5_1" edc:desc="" edc:mask="0x1" edc:name="FIL5_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL6_0" edc:desc="" edc:mask="0x1" edc:name="FIL6_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL6_1" edc:desc="" edc:mask="0x1" edc:name="FIL6_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL7_0" edc:desc="" edc:mask="0x1" edc:name="FIL7_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL7_1" edc:desc="" edc:mask="0x1" edc:name="FIL7_1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MSEL2" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDF2">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL8_0" edc:desc="" edc:mask="0x1" edc:name="FIL8_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL8_1" edc:desc="" edc:mask="0x1" edc:name="FIL8_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL9_0" edc:desc="" edc:mask="0x1" edc:name="FIL9_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL9_1" edc:desc="" edc:mask="0x1" edc:name="FIL9_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL10_0" edc:desc="" edc:mask="0x1" edc:name="FIL10_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL10_1" edc:desc="" edc:mask="0x1" edc:name="FIL10_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL11_0" edc:desc="" edc:mask="0x1" edc:name="FIL11_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL11_1" edc:desc="" edc:mask="0x1" edc:name="FIL11_1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="MSEL3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="MSEL3" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xDF3">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="FIL12_0" edc:desc="" edc:mask="0x1" edc:name="FIL12_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL12_1" edc:desc="" edc:mask="0x1" edc:name="FIL12_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL13_0" edc:desc="" edc:mask="0x1" edc:name="FIL13_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL13_1" edc:desc="" edc:mask="0x1" edc:name="FIL13_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL14_0" edc:desc="" edc:mask="0x1" edc:name="FIL14_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL14_1" edc:desc="" edc:mask="0x1" edc:name="FIL14_1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL15_0" edc:desc="" edc:mask="0x1" edc:name="FIL15_0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FIL15_1" edc:desc="" edc:mask="0x1" edc:name="FIL15_1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:AdjustPoint edc:offset="4" edc:_addr="0xDF4"/>
        <edc:SFRDef edc:access="nnnnnn--" edc:cname="BSEL0" edc:desc="" edc:impl="0xfc" edc:isindirect="false" edc:isvolatile="true" edc:mclr="000000--" edc:name="BSEL0" edc:nzwidth="0x8" edc:por="000000--" edc:_addr="0xDF8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="B0TXEN" edc:desc="" edc:mask="0x1" edc:name="B0TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1TXEN" edc:desc="" edc:mask="0x1" edc:name="B1TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B2TXEN" edc:desc="" edc:mask="0x1" edc:name="B2TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B3TXEN" edc:desc="" edc:mask="0x1" edc:name="B3TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4TXEN" edc:desc="" edc:mask="0x1" edc:name="B4TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B5TXEN" edc:desc="" edc:mask="0x1" edc:name="B5TXEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="w" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
