Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1EIDL" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1EIDL" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE34">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EID0" edc:desc="" edc:mask="0x1" edc:name="EID0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID1" edc:desc="" edc:mask="0x1" edc:name="EID1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID2" edc:desc="" edc:mask="0x1" edc:name="EID2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID3" edc:desc="" edc:mask="0x1" edc:name="EID3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID4" edc:desc="" edc:mask="0x1" edc:name="EID4" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID5" edc:desc="" edc:mask="0x1" edc:name="EID5" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID6" edc:desc="" edc:mask="0x1" edc:name="EID6" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EID7" edc:desc="" edc:mask="0x1" edc:name="EID7" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B1EID0" edc:desc="" edc:mask="0x1" edc:name="B1EID0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1EID1" edc:desc="" edc:mask="0x1" edc:name="B1EID1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1EID2" edc:desc="" edc:mask="0x1" edc:name="B1EID2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1EID3" edc:desc="" edc:mask="0x1" edc:name="B1EID3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1EID4" edc:desc="" edc:mask="0x1" edc:name="B1EID4" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1EID5" edc:desc="" edc:mask="0x1" edc:name="B1EID5" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1EID6" edc:desc="" edc:mask="0x1" edc:name="B1EID6" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1EID7" edc:desc="" edc:mask="0x1" edc:name="B1EID7" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="-nrrnnnn" edc:cname="B1DLC" edc:desc="" edc:impl="0x7f" edc:isindirect="false" edc:isvolatile="true" edc:mclr="-uuuuuuu" edc:name="B1DLC" edc:nzwidth="0x8" edc:por="-xxxxxxx" edc:_addr="0xE35">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="DLC0" edc:desc="" edc:mask="0x1" edc:name="DLC0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC1" edc:desc="" edc:mask="0x1" edc:name="DLC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC2" edc:desc="" edc:mask="0x1" edc:name="DLC2" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="DLC3" edc:desc="" edc:mask="0x1" edc:name="DLC3" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB0" edc:desc="" edc:mask="0x1" edc:name="RB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RB1" edc:desc="" edc:mask="0x1" edc:name="RB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXRTR" edc:desc="" edc:mask="0x1" edc:name="RXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="4"/>
              <edc:SFRFieldDef edc:cname="RESRB0" edc:desc="" edc:mask="0x1" edc:name="RESRB0" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RESRB1" edc:desc="" edc:mask="0x1" edc:name="RESRB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXRTR" edc:desc="" edc:mask="0x1" edc:name="TXRTR" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:SFRFieldDef edc:cname="B1DLC0" edc:desc="" edc:mask="0x1" edc:name="B1DLC0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1DLC1" edc:desc="" edc:mask="0x1" edc:name="B1DLC1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1DLC2" edc:desc="" edc:mask="0x1" edc:name="B1DLC2" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1DLC3" edc:desc="" edc:mask="0x1" edc:name="B1DLC3" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1RB0" edc:desc="" edc:mask="0x1" edc:name="B1RB0" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1RB1" edc:desc="" edc:mask="0x1" edc:name="B1RB1" edc:nzwidth="1"/>
              <edc:SFRFieldDef edc:cname="B1RXRTR" edc:desc="" edc:mask="0x1" edc:name="B1RXRTR" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B1D0" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B1D0" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE36">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B1D00" edc:desc="" edc:mask="0x1" edc:name="B1D00" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D01" edc:desc="" edc:mask="0x1" edc:name="B1D01" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D02" edc:desc="" edc:mask="0x1" edc:name="B1D02" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D03" edc:desc="" edc:mask="0x1" edc:name="B1D03" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D04" edc:desc="" edc:mask="0x1" edc:name="B1D04" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D05" edc:desc="" edc:mask="0x1" edc:name="B1D05" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D06" edc:desc="" edc:mask="0x1" edc:name="B1D06" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B1D07" edc:desc="" edc:mask="0x1" edc:name="B1D07" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
