Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D1" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D1" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE67">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D10" edc:desc="" edc:mask="0x1" edc:name="B4D10" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D11" edc:desc="" edc:mask="0x1" edc:name="B4D11" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D12" edc:desc="" edc:mask="0x1" edc:name="B4D12" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D13" edc:desc="" edc:mask="0x1" edc:name="B4D13" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D14" edc:desc="" edc:mask="0x1" edc:name="B4D14" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D15" edc:desc="" edc:mask="0x1" edc:name="B4D15" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D16" edc:desc="" edc:mask="0x1" edc:name="B4D16" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D17" edc:desc="" edc:mask="0x1" edc:name="B4D17" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D2" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE68">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D20" edc:desc="" edc:mask="0x1" edc:name="B4D20" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D21" edc:desc="" edc:mask="0x1" edc:name="B4D21" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D22" edc:desc="" edc:mask="0x1" edc:name="B4D22" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D23" edc:desc="" edc:mask="0x1" edc:name="B4D23" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D24" edc:desc="" edc:mask="0x1" edc:name="B4D24" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D25" edc:desc="" edc:mask="0x1" edc:name="B4D25" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D26" edc:desc="" edc:mask="0x1" edc:name="B4D26" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D27" edc:desc="" edc:mask="0x1" edc:name="B4D27" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D3" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE69">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D30" edc:desc="" edc:mask="0x1" edc:name="B4D30" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D31" edc:desc="" edc:mask="0x1" edc:name="B4D31" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D32" edc:desc="" edc:mask="0x1" edc:name="B4D32" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D33" edc:desc="" edc:mask="0x1" edc:name="B4D33" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D34" edc:desc="" edc:mask="0x1" edc:name="B4D34" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D35" edc:desc="" edc:mask="0x1" edc:name="B4D35" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D36" edc:desc="" edc:mask="0x1" edc:name="B4D36" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D37" edc:desc="" edc:mask="0x1" edc:name="B4D37" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D4" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D4" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE6A">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D40" edc:desc="" edc:mask="0x1" edc:name="B4D40" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D41" edc:desc="" edc:mask="0x1" edc:name="B4D41" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D42" edc:desc="" edc:mask="0x1" edc:name="B4D42" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D43" edc:desc="" edc:mask="0x1" edc:name="B4D43" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D44" edc:desc="" edc:mask="0x1" edc:name="B4D44" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D45" edc:desc="" edc:mask="0x1" edc:name="B4D45" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D46" edc:desc="" edc:mask="0x1" edc:name="B4D46" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D47" edc:desc="" edc:mask="0x1" edc:name="B4D47" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D5" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D5" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE6B">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D50" edc:desc="" edc:mask="0x1" edc:name="B4D50" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D51" edc:desc="" edc:mask="0x1" edc:name="B4D51" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D52" edc:desc="" edc:mask="0x1" edc:name="B4D52" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D53" edc:desc="" edc:mask="0x1" edc:name="B4D53" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D54" edc:desc="" edc:mask="0x1" edc:name="B4D54" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D55" edc:desc="" edc:mask="0x1" edc:name="B4D55" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D56" edc:desc="" edc:mask="0x1" edc:name="B4D56" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D57" edc:desc="" edc:mask="0x1" edc:name="B4D57" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D6" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D6" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE6C">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D60" edc:desc="" edc:mask="0x1" edc:name="B4D60" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D61" edc:desc="" edc:mask="0x1" edc:name="B4D61" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D62" edc:desc="" edc:mask="0x1" edc:name="B4D62" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D63" edc:desc="" edc:mask="0x1" edc:name="B4D63" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D64" edc:desc="" edc:mask="0x1" edc:name="B4D64" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D65" edc:desc="" edc:mask="0x1" edc:name="B4D65" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D66" edc:desc="" edc:mask="0x1" edc:name="B4D66" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D67" edc:desc="" edc:mask="0x1" edc:name="B4D67" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="B4D7" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uuuuuuuu" edc:name="B4D7" edc:nzwidth="0x8" edc:por="xxxxxxxx" edc:_addr="0xE6D">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="B4D70" edc:desc="" edc:mask="0x1" edc:name="B4D70" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D71" edc:desc="" edc:mask="0x1" edc:name="B4D71" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D72" edc:desc="" edc:mask="0x1" edc:name="B4D72" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D73" edc:desc="" edc:mask="0x1" edc:name="B4D73" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D74" edc:desc="" edc:mask="0x1" edc:name="B4D74" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D75" edc:desc="" edc:mask="0x1" edc:name="B4D75" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D76" edc:desc="" edc:mask="0x1" edc:name="B4D76" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="B4D77" edc:desc="" edc:mask="0x1" edc:name="B4D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="7"/>
              <edc:SFRFieldDef edc:cname="B46D77" edc:desc="" edc:mask="0x1" edc:name="B46D77" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Integer"/>
        </edc:SFRDef>
