Davidn00/digital_thermometer/Microchip Packs/edc/PIC18LF8585.PIC
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="PIR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="PIR3" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFA4">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0IF" edc:desc="" edc:mask="0x1" edc:name="RXB0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1IF" edc:desc="" edc:mask="0x1" edc:name="RXB1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0IF" edc:desc="" edc:mask="0x1" edc:name="TXB0IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1IF" edc:desc="" edc:mask="0x1" edc:name="TXB1IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2IF" edc:desc="" edc:mask="0x1" edc:name="TXB2IF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERRIF" edc:desc="" edc:mask="0x1" edc:name="ERRIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIF" edc:desc="" edc:mask="0x1" edc:name="WAKIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRXIF" edc:desc="" edc:mask="0x1" edc:name="IRXIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FIFOWMIF" edc:desc="" edc:mask="0x1" edc:name="FIFOWMIF" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBnIF" edc:desc="" edc:mask="0x1" edc:name="RXBnIF" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXBnIF" edc:desc="" edc:mask="0x1" edc:name="TXBnIF" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBNIF" edc:desc="" edc:mask="0x1" edc:name="RXBNIF" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXBNIF" edc:desc="" edc:mask="0x1" edc:name="TXBNIF" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="IPR3" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="11111111" edc:name="IPR3" edc:nzwidth="0x8" edc:por="11111111" edc:_addr="0xFA5">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RXB0IP" edc:desc="" edc:mask="0x1" edc:name="RXB0IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXB1IP" edc:desc="" edc:mask="0x1" edc:name="RXB1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB0IP" edc:desc="" edc:mask="0x1" edc:name="TXB0IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB1IP" edc:desc="" edc:mask="0x1" edc:name="TXB1IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXB2IP" edc:desc="" edc:mask="0x1" edc:name="TXB2IP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ERRIP" edc:desc="" edc:mask="0x1" edc:name="ERRIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WAKIP" edc:desc="" edc:mask="0x1" edc:name="WAKIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="IRXIP" edc:desc="" edc:mask="0x1" edc:name="IRXIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="FIFOWMIP" edc:desc="" edc:mask="0x1" edc:name="FIFOWMIP" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBnIP" edc:desc="" edc:mask="0x1" edc:name="RXBnIP" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="2"/>
              <edc:SFRFieldDef edc:cname="TXBnIP" edc:desc="" edc:mask="0x1" edc:name="TXBnIP" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x1"/>
              <edc:SFRFieldDef edc:cname="RXBNIP" edc:desc="" edc:mask="0x1" edc:name="RXBNIP" edc:nzwidth="1"/>
              <edc:AdjustPoint edc:offset="0x2"/>
              <edc:SFRFieldDef edc:cname="TXBNIP" edc:desc="" edc:mask="0x1" edc:name="TXBNIP" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nn-nnnss" edc:cname="EECON1" edc:desc="" edc:impl="0xdf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="uu-0u000" edc:name="EECON1" edc:nzwidth="0x8" edc:por="xx-0x000" edc:_addr="0xFA6">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RD" edc:desc="" edc:mask="0x1" edc:name="RD" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WR" edc:desc="" edc:mask="0x1" edc:name="WR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WREN" edc:desc="" edc:mask="0x1" edc:name="WREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="WRERR" edc:desc="" edc:mask="0x1" edc:name="WRERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FREE" edc:desc="" edc:mask="0x1" edc:name="FREE" edc:nzwidth="0x1"/>
              <edc:AdjustPoint edc:offset="1"/>
              <edc:SFRFieldDef edc:cname="CFGS" edc:desc="" edc:mask="0x1" edc:name="CFGS" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="EEPGD" edc:desc="" edc:mask="0x1" edc:name="EEPGD" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x6"/>
              <edc:SFRFieldDef edc:cname="EEFS" edc:desc="" edc:mask="0x1" edc:name="EEFS" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="wwwwwwww" edc:cname="EECON2" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="--------" edc:name="EECON2" edc:nzwidth="0x8" edc:por="--------" edc:_addr="0xFA7">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EECON2" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EECON2" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEDATA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EEDATA" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFA8">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEDATA" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EEDATA" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="rw" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnnn" edc:cname="EEADR" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000" edc:name="EEADR" edc:nzwidth="0x8" edc:por="00000000" edc:_addr="0xFA9">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEADR" edc:desc="" edc:islanghidden="true" edc:mask="0xff" edc:name="EEADR" edc:nzwidth="0x8"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="------nn" edc:cname="EEADRH" edc:desc="" edc:impl="0x3" edc:isindirect="false" edc:isvolatile="true" edc:mclr="------00" edc:name="EEADRH" edc:nzwidth="0x8" edc:por="------00" edc:_addr="0xFAA">
          <edc:AliasList/>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="EEADRH" edc:desc="" edc:islanghidden="true" edc:mask="0x3" edc:name="EEADRH" edc:nzwidth="0x2"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="rw" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnrrr" edc:cname="RCSTA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="0000000x" edc:name="RCSTA" edc:nzwidth="0x8" edc:por="0000000x" edc:_addr="0xFAB">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="RCSTA1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="RX9D" edc:desc="" edc:mask="0x1" edc:name="RX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR" edc:desc="" edc:mask="0x1" edc:name="OERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR" edc:desc="" edc:mask="0x1" edc:name="FERR" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN" edc:desc="" edc:mask="0x1" edc:name="ADDEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN" edc:desc="" edc:mask="0x1" edc:name="CREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN" edc:desc="" edc:mask="0x1" edc:name="SREN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX9" edc:desc="" edc:mask="0x1" edc:name="RX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN" edc:desc="" edc:mask="0x1" edc:name="SPEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:AdjustPoint edc:offset="3"/>
              <edc:SFRFieldDef edc:cname="ADEN" edc:desc="" edc:mask="0x1" edc:name="ADEN" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.1">
              <edc:SFRFieldDef edc:cname="RX9D1" edc:desc="" edc:mask="0x1" edc:name="RX9D1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="OERR1" edc:desc="" edc:mask="0x1" edc:name="OERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="FERR1" edc:desc="" edc:mask="0x1" edc:name="FERR1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="ADDEN1" edc:desc="" edc:mask="0x1" edc:name="ADDEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CREN1" edc:desc="" edc:mask="0x1" edc:name="CREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SREN1" edc:desc="" edc:mask="0x1" edc:name="SREN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="RX91" edc:desc="" edc:mask="0x1" edc:name="RX91" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SPEN1" edc:desc="" edc:mask="0x1" edc:name="SPEN1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="HT.0">
              <edc:AdjustPoint edc:offset="0x5"/>
              <edc:SFRFieldDef edc:cname="SRENA" edc:desc="" edc:mask="0x1" edc:name="SRENA" edc:nzwidth="1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
        <edc:SFRDef edc:access="nnnnnnrn" edc:cname="TXSTA" edc:desc="" edc:impl="0xff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000010" edc:name="TXSTA" edc:nzwidth="0x8" edc:por="00000010" edc:_addr="0xFAC">
          <edc:AliasList>
            <edc:LegacyAlias edc:cname="TXSTA1"/>
          </edc:AliasList>
          <edc:SFRModeList>
            <edc:SFRMode edc:id="DS.0">
              <edc:SFRFieldDef edc:cname="TX9D" edc:desc="" edc:mask="0x1" edc:name="TX9D" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT" edc:desc="" edc:mask="0x1" edc:name="TRMT" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH" edc:desc="" edc:mask="0x1" edc:name="BRGH" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB" edc:desc="" edc:mask="0x1" edc:name="SENDB" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC" edc:desc="" edc:mask="0x1" edc:name="SYNC" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN" edc:desc="" edc:mask="0x1" edc:name="TXEN" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX9" edc:desc="" edc:mask="0x1" edc:name="TX9" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC" edc:desc="" edc:mask="0x1" edc:name="CSRC" edc:nzwidth="0x1"/>
            </edc:SFRMode>
            <edc:SFRMode edc:id="LT.0">
              <edc:SFRFieldDef edc:cname="TX9D1" edc:desc="" edc:mask="0x1" edc:name="TX9D1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TRMT1" edc:desc="" edc:mask="0x1" edc:name="TRMT1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="BRGH1" edc:desc="" edc:mask="0x1" edc:name="BRGH1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SENDB1" edc:desc="" edc:mask="0x1" edc:name="SENDB1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="SYNC1" edc:desc="" edc:mask="0x1" edc:name="SYNC1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TXEN1" edc:desc="" edc:mask="0x1" edc:name="TXEN1" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="TX91" edc:desc="" edc:mask="0x1" edc:name="TX91" edc:nzwidth="0x1"/>
              <edc:SFRFieldDef edc:cname="CSRC1" edc:desc="" edc:mask="0x1" edc:name="CSRC1" edc:nzwidth="0x1"/>
            </edc:SFRMode>
          </edc:SFRModeList>
          <edc:StimInfo edc:stimpcfiles="" edc:stimregfiles="w" edc:stimscl="rwb" edc:stimtype="Record"/>
        </edc:SFRDef>
